perftest/backend_results.txt
Running 30s test @ http://localhost:3001/api/users
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.64ms  623.65us  35.19ms   93.65%
    Req/Sec     7.07k   381.11     7.96k    92.42%
  Latency Distribution
     50%    1.66ms
     75%    1.78ms
     90%    1.88ms
     99%    2.14ms
  1688034 requests in 30.02s, 323.48MB read
Requests/sec:  56237.59
Transfer/sec:     10.78MB

--- Backend Baseline Statistics ---
Direct backend requests: 0